/*
 *       접근지정어 : 사용범위 지정
 *       ------------------------------------------------------------------------------------
 *                 자신의 클래스        같은 폴더에서만 사용        상속이 있는 같은 폴더의       모든 폴더
 *                  에서만 사용            (패키지)              경우 다른폴더로 접근
 *       ------------------------------------------------------------------------------------
 *       private      O                   X                        X                X
 *       : 데이터 은닉화 
 *       : (캡슐화)
 *       ------------------------------------------------------------------------------------
 *       default      O                   O                        X                X
 *       ------------------------------------------------------------------------------------
 *       protected    O                   O                        O                X
 *       ------------------------------------------------------------------------------------
 *       public       O                   O                        O                O
 *       : 그러나 보안상 위험이 있음으로 모든곳에 public 사용하면 안됨
 *       ------------------------------------------------------------------------------------
 *       
 *       [클래스 , 멤버변수 , 멤버메소드 => 지역변수에서는 접근지정어가 없다.]
 *        => 클래스
 *           [접근지정어] class ClassName => 기본 public : 모든 클래스에서 연결하기 때문
 *           --------:주로 public
 *           
 *        => 멤버변수
 *           [접근지정어] 데이터형 변수명
 *           --------:데이터 보호(은닉화) private ==> 시쿼어 코딩(안하면불법임)
 *                                  -------(=다른클래스에서접근불가능)
 *           
 *        => 멤버메소드 : 다른 메소드와 통신할때 사용. 공개가되어있어야 통신가능=public
 *           [접근지정어] 리턴형 메소드명(매개변수 목록){}
 *           --------:public
 *           
 *        => 생성자
 *           [접근지정어] 클래스명()
 *           --------:주로 public
 *           public으로 안되어있으면 인식이 안되서 대부분 public 사용함
 *       ------------------------------------------------------------------------------------
 *       클래스 저장위치 설정 => 폴더안에 저장
 *                         ---------패키지
 *                         
 */
public class MainClass {
	
	//생성자는 자동생성할때 무조건 public 으로 생성됨
	public MainClass() {
		
	}
	public static void main(String[] args) {
		
	}

}
