/*
 *    면접에서 많이 나오는 질문
 *    => 대비잘하는법 : 각 개념에 핵심단어를 결론내리고 대답을 이어가면됨
 *    --------------------
 *    Q. 오버라이징과 오버로딩의 차이란?
 *    A. 오버라이징=modify --  
 *       오버로딩=new ------ 가 각각의 핵심단어
 *    
 *    Q. 함수와 메소드의 차이란?
 *    A. 한가지 기능을 수행하는것을 동일하나
 *       * 함수는 독립적으로 사용함
 *       * 메소드는 클래스에 종속
 *         메소드는 종료하는 시점(=return)이 있음
 *         public static void main(String[] args)
 *         그러나 위에처럼 void인 경우 안써도 추가되어있음
 *         컴파일러가 자동으로 추가해줌
 *    
 *    따라서 모든 메소드는 return문을 하나 가지고 잇다
 *    
 *    
 *    배열 / 메소드
 *    ---------- 클래스
 *               -----객체지향에 맞게 => 유지보수가 쉽게 제작하는것
 *                    데이터 보호(캡슐화)
 *                    재사용 (상속 : is-a, 포함 : has-a)
 *                    수정, 추가
 *                    오버라이징(=변경), 오버로딩(=추가)   
 */
public class 제어문_반복제어문4 {

	public static void main(String[] args) {
		

	}

}
